{
	"- Battery: check “below (<)”, limit 10, hysteresis 2, min duration 10 minutes\n- Humidity: check “below (<)”, limit 35, min duration 0\n- Fill level: check “above (>)”, limit 5000, min duration 1 minute\n- Window contact: check “is true” (or “is false”, depending on device), min duration 12 hours": "- Batterie: Prüfung „unter (<)“, Grenzwert 10, Hysterese 2, Mindestdauer 10 Minuten\n- Luftfeuchte: Prüfung „unter (<)“, Grenzwert 35, Mindestdauer 0\n- Füllstand: Prüfung „über (>)“, Grenzwert 5000, Mindestdauer 1 Minute\n- Fensterkontakt: Prüfung „ist wahr“ (oder „ist falsch“ – je nach Gerät), Mindestdauer 12 Stunden",
	"A higher-priority monitoring rule is active for this object.": "Für dieses Objekt ist eine höher priorisierte Überwachung aktiv.",
	"Additional information from the source that manages this object.": "Zusätzliche Informationen der Quelle, die dieses Objekt verwaltet.",
	"Additional message on session start": "Zusätzliche Meldung zum Session‑Start",
	"Alerts if this object has no update (ts) or no value change (lc) longer than allowed.": "Meldet, wenn dieses Objekt länger als erlaubt kein Update (ts) oder keine Wertänderung (lc) liefert.",
	"Alerts when a trigger is active and this object does not react as expected within the time window.": "Meldet, wenn ein Trigger aktiv ist und dieses Objekt innerhalb des Zeitfensters nicht wie erwartet reagiert.",
	"Alerts when a value has no quiet phase for a long time or shows a suspicious trend in one direction within a time window.": "Meldet, wenn ein Wert über längere Zeit keine Ruhephase hat oder sich in einem Zeitfenster auffällig in eine Richtung bewegt.",
	"Alerts when the current value crosses a boundary, leaves a range, or a boolean stays TRUE/FALSE for too long.": "Meldet, wenn der aktuelle Wert eine Grenze unter-/überschreitet, einen Bereich verlässt oder ein Boolean zu lange TRUE/FALSE bleibt.",
	"Alerts when the value has no sufficient quiet phase for a long time.": "Meldet, wenn der Wert über längere Zeit keine ausreichende Ruhephase hat.",
	"Alerts when the value keeps moving in one direction for a long time (e.g. water meter increases for hours).": "Meldet, wenn der Wert über längere Zeit in eine Richtung läuft (z. B. Wasserzähler steigt stundenlang).",
	"An update must arrive within this time.": "Spätestens nach dieser Zeit muss ein Update kommen.",
	"Auto-remove message(s)": "Meldung(en) automatisch entfernen",
	"Avoids flapping around the boundary. Example: alert when < 10, back to ok only above 12 (hysteresis 2). 0 = off.": "Verhindert Flattern um die Grenze. Beispiel: Meldung bei < 10, erst wieder ok ab 12 (Hysterese 2). 0 = aus.",
	"Back to normal": "Rückkehr zum Normalzustand",
	"Boolean (true/false)": "Boolean (true/false)",
	"Cancel finish timer if power rises again": "Fertig-Timer abbrechen, wenn Leistung wieder steigt",
	"Check": "Prüfung",
	"Choose how this datapoint should react.": "Wähle, wie dieser Datenpunkt reagieren soll.",
	"Choose the rule type that fits this object.": "Wähle den Regeltyp, der zu diesem Objekt passt.",
	"Choose the rule type; then configure the details in the corresponding tab.": "Wähle den Regeltyp; die Details konfigurierst du danach im passenden Tab.",
	"Comparison value": "Vergleichswert",
	"Comparison value (number)": "Vergleichswert (Zahl)",
	"Comparison value (text)": "Vergleichswert (Text)",
	"Condition": "Bedingung",
	"Configure what the message looks like, when it repeats, and how it is closed when everything is back to normal.": "Hier stellst du ein, wie die Meldung aussieht, wann sie wiederholt wird und wie sie beim Normalzustand geschlossen wird.",
	"Consumption counter (optional)": "Verbrauchszähler (optional)",
	"Continuous activity": "Dauerbewegung",
	"Continuous activity (changes without longer pause)": "Dauerbewegung (ändert sich ohne längere Pause)",
	"Cooldown": "Cooldown",
	"Cost per consumption unit (optional)": "Kosten pro Verbrauchseinheit (optional)",
	"Create start message": "Startmeldung erzeugen",
	"Days": "Tage",
	"Delay": "Verzögerung",
	"Dependency (Trigger)": "Abhängigkeit (Trigger)",
	"Dependency (Trigger): When another object becomes active, this object must react within a time window as you expect.\n\nExamples:\n- Valve = ON → water meter must increase within 10 min (delta)\n- Plug = ON → power must become >= 5 W within 30 s\n- Heating = ON → flow temperature must rise within 15 min\n\nTip: Choose a generous time window if devices are slow or have latency.": "Abhängigkeit (Trigger): Wenn ein anderes Objekt aktiv wird, muss dieses Objekt innerhalb eines Zeitfensters so reagieren, wie du es erwartest.\n\nBeispiele:\n- Ventil = EIN → Wasserzähler muss innerhalb von 10 min steigen (Delta)\n- Steckdose = EIN → Leistung muss innerhalb von 30 s >= 5 W werden\n- Heizung = EIN → Vorlauftemperatur muss innerhalb von 15 min steigen\n\nTipp: Zeitfenster großzügig wählen, wenn Geräte träge sind oder Verzögerung haben.",
	"Description": "Beschreibung",
	"Detects the start and end of a process based on power thresholds and a stop delay.": "Erkennt Start und Ende eines Vorgangs anhand von Leistungsschwellen und einer Stop‑Verzögerung.",
	"Duration": "Dauer",
	"Example (EV charging):\n- Start threshold 50 W\n- Stop threshold 15 W\n- Finish after 5 minutes below 15 W\n- Optional: energy counter (kWh) + price (€/kWh) → consumption & cost": "Beispiel (E‑Auto laden):\n- Start-Schwelle 50 W\n- Stop-Schwelle 15 W\n- Fertig nach 5 Minuten unter 15 W\n- Optional: Energiezähler (kWh) + Preis (€/kWh) → Verbrauch & Kosten",
	"Examples": "Beispiele",
	"Examples:\n- Leak: profile “Trend”, direction “rising”, trend window 12 hours\n- Flapping sensor: profile “Continuous activity”, max time without quiet 3 hours, quiet phase 10 minutes": "Beispiele:\n- Leckage: Profil „Trend“, Richtung „steigend“, Trend-Fenster 12 Stunden\n- Flatternder Sensor: Profil „Dauerbewegung“, Max. Dauer ohne Ruhe 3 Stunden, Ruhephase 10 Minuten",
	"Examples:\n- Temperature sensor: maximum gap 12 hours\n- Power meter: maximum gap 30 seconds\n- Device with keepalive: maximum gap 5 minutes": "Beispiele:\n- Temperatursensor: maximaler Abstand 12 Stunden\n- Stromzähler/Leistung: maximaler Abstand 30 Sekunden\n- Gerät mit Keepalive: maximaler Abstand 5 Minuten",
	"Examples:\n- Valve == TRUE → within 10 minutes the water meter must increase by at least 1\n- Plug == TRUE → within 30 seconds the power must become >= 5 W\n- Heating == TRUE → within 15 minutes the flow temperature must rise (delta up)": "Beispiele:\n- Ventil == TRUE → innerhalb von 10 Minuten muss der Wasserzähler um mindestens 1 steigen\n- Steckdose == TRUE → innerhalb von 30 Sekunden muss die Leistung >= 5 W werden\n- Heizung == TRUE → innerhalb von 15 Minuten muss die Vorlauftemperatur steigen (Delta Up)",
	"Expected reaction": "Erwartete Reaktion",
	"Expert": "Expert",
	"Filters measurement noise. Only changes >= this delta count (0 = every change).": "Ignoriert Messrauschen. Nur Änderungen >= dieses Delta zählen (0 = jede Änderung).",
	"Filters short peaks (0 = immediate).": "Filter gegen kurze Peaks (0 = sofort).",
	"Finish after": "Fertig nach",
	"For leaks, “rising” is usually appropriate (e.g. water meter).": "Für Leckage ist meist „steigend“ sinnvoll (z. B. Wasserzähler).",
	"Freshness": "Aktualisierungsintervall",
	"Freshness: You get a message if this object has no update (ts) or no actual value change (lc) for too long.\n\nExamples:\n- Temperature sensor: at least one update every 12 h\n- Power/energy meter: at least one update every 30 s\n- Device with keepalive: at least one heartbeat every 5 min\n\nTip: If a device sends keepalives even without changes, use ts; if it only sends on change, use lc.": "Aktualisierungsintervall: Du bekommst eine Meldung, wenn dieses Objekt zu lange kein Update (ts) oder keine echte Wertänderung (lc) hatte.\n\nBeispiele:\n- Temperatursensor: spätestens alle 12 h eine Aktualisierung\n- Stromzähler/Leistung: spätestens alle 30 s ein Update\n- Gerät mit Keepalive: spätestens alle 5 min ein Lebenszeichen\n\nTipp: Wenn ein Gerät auch ohne Wertänderung sendet, nutze ts; wenn es nur bei Änderung sendet, nutze lc.",
	"Gate (on/off) – optional": "Gate (Ein/Aus) – optional",
	"Gate active when": "Gate aktiv, wenn",
	"Hours": "Stunden",
	"How important is the message?": "Wie wichtig ist die Meldung?",
	"How long the trend must persist before alerting.": "Wie lange der Trend anhalten muss, bevor gemeldet wird.",
	"Hysteresis": "Hysterese",
	"If disabled, FALSE is expected.": "Wenn deaktiviert, wird FALSE erwartet.",
	"If enabled, msghub creates an additional message when the session starts.": "Wenn aktiv, erzeugt msghub zusätzlich eine Meldung beim Start der Session.",
	"If no quiet phase is reached for this long, alert.": "Wenn so lange keine Ruhephase erreicht wird, wird gemeldet.",
	"If power rises above the stop threshold again, the finish timer is cancelled.": "Wenn die Leistung wieder über die Stop‑Schwelle geht, wird der Fertig‑Timer abgebrochen.",
	"If set, a cost in € is calculated at the end.": "Wenn gesetzt, wird am Ende zusätzlich ein Euro‑Betrag berechnet.",
	"If set, start/stop is checked only while this gate is active (e.g. switch ON).": "Wenn gesetzt, wird Start/Stop nur geprüft, wenn dieses Gate aktiv ist (z. B. Schalter EIN).",
	"If set, the start value is stored and consumption is calculated at the end (end − start).": "Wenn gesetzt, wird der Start‑Stand gemerkt und am Ende der Verbrauch berechnet (Ende − Start).",
	"Inputs": "Eingänge",
	"It must be quiet for this long to count as “settled”.": "So lange muss es ruhig sein, damit es als „zur Ruhe gekommen“ zählt.",
	"Kind": "Typ",
	"Leak/trend (rises/falls over long time)": "Leckage/Trend (steigt/fällt über lange Zeit)",
	"Level": "Level",
	"Limit": "Grenzwert",
	"Makes the comparison explicit. For “true/false” you don’t need a comparison value.": "Damit der Vergleich eindeutig ist. Bei „wahr/falsch“ brauchst du keinen Vergleichswert.",
	"Managed by:": "Überwacht durch:",
	"Managed since:": "Überwacht seit:",
	"Manual rules are disabled and not shown.\n\nIf you want to change monitoring, change the configuration of the source (ingest/plugin) that manages this object.": "Manuelle Regeln sind deaktiviert und werden nicht angezeigt.\n\nWenn du die Überwachung ändern willst, ändere die Konfiguration der Quelle (Ingest/Plugin), die dieses Objekt verwaltet.",
	"Max. time without quiet": "Max. Dauer ohne Ruhe",
	"Maximum": "Maximum",
	"Maximum gap": "Maximaler Abstand",
	"Message": "Meldung",
	"Message details": "Meldungsdetails",
	"Message kind.": "Typ der Meldung.",
	"Min. delta": "Min. Delta",
	"Min. hold above start": "Mindestdauer über Start",
	"Min. total change": "Min. Gesamtänderung",
	"Minimum": "Minimum",
	"Minimum delta": "Mindest-Delta",
	"Minimum duration": "Mindestdauer",
	"Minutes": "Minuten",
	"Monitoring": "Überwachung",
	"Non-settling value": "Unruhiger Wert",
	"Non-settling value: You get a message if a value has no quiet phase for a long time or shows a suspicious trend in one direction over a time window.\n\nExamples:\n- Water meter increases for hours without quiet phase → possible leak\n- Sensor value keeps fluctuating without stable phase → RF issues / defective sensor\n- Counter keeps running although it usually has idle phases → consumer stuck\n\nTip: Use “Min. delta” to filter measurement noise.": "Unruhiger Wert: Du bekommst eine Meldung, wenn ein Wert über lange Zeit keine Ruhephase hat oder sich über ein Zeitfenster auffällig in eine Richtung bewegt.\n\nBeispiele:\n- Wasserzähler steigt über Stunden ohne Ruhephase → mögliche Leckage\n- Sensorwert schwankt dauerhaft ohne stabile Phase → Funkstörung/defekter Sensor\n- Counter läuft „immer weiter“, obwohl er normalerweise Pausen hat → Verbraucher hängt\n\nTipp: Mit „Min. Delta“ blendest du Messrauschen aus.",
	"Note (Session): The following settings apply to both, the session start (beginning) message and the session end (finished) message": "Hinweis (Session): Die folgenden Einstellungen beziehen sich sowohl auf die Meldung zum Session‑Start (Beginn) als auch auf die Meldung zum Session‑Ende (Fertig).",
	"Note (Session): The following settings apply to the session end (finished) message.": "Hinweis (Session): Die folgenden Einstellungen beziehen sich auf die Meldung zum Session‑Ende (Fertig).",
	"Note (Session): The following settings apply to the session start (beginning) message.": "Hinweis (Session): Die folgenden Einstellungen beziehen sich auf die Meldung zum Session‑Start (Beginn).",
	"Note (Session): The following settings in this tab apply to the session start (beginning) message.": "Hinweis (Session): Die folgenden Einstellungen in diesem Tab beziehen sich auf die Meldung zum Session‑Start (Beginn).",
	"Note (from system)": "Hinweis (vom System)",
	"Notice": "Hinweis",
	"Number": "Zahl",
	"Only for below/above (lt/gt).": "Nur für unter/über (lt/gt).",
	"Only for delta rules. Example: counter must increase by at least 1.": "Nur für Delta-Regeln. Beispiel: Zähler muss um mindestens 1 steigen.",
	"Only for range (inside/outside).": "Nur für Bereich (inside/outside).",
	"Only for threshold rules (>= / <=).": "Nur für Schwellen-Regeln (>= / <=).",
	"Only relevant for “equals”. Examples: true, 1, ON, auto …": "Nur relevant bei „gleich“. Beispiele: true, 1, ON, auto …",
	"Optional: Only alert if the value changes by at least X in total within the trend window (0 = ignore).": "Optional: Nur melden, wenn sich der Wert im Trend-Fenster insgesamt um mindestens X bewegt (0 = egal).",
	"Optional: summary": "Optional: Zusammenfassung",
	"Optionally set a gate (on/off). Then the session is evaluated only while the gate is active.": "Optional kannst du hier ein Gate (Ein/Aus) setzen. Dann wird die Session nur ausgewertet, wenn das Gate aktiv ist.",
	"Profile": "Profil",
	"Quiet phase": "Ruhephase",
	"Reminder": "Erinnerung",
	"Repeat while the issue is still active (0 = off).": "Erneut melden, solange der Fehler noch aktiv ist (0 = aus).",
	"Repeats and reminders": "Wiederholungen und Erinnerungen",
	"Rule type": "Regeltyp",
	"Seconds": "Sekunden",
	"Session (Start/Stop)": "Session (Start/Stop)",
	"Session (Start/Stop): You get a message when a process starts and later finishes again – usually detected via power thresholds and a stop delay.\n\nExamples:\n- E-bike charging: start >= 50 W, finish < 15 W for 5 min\n- Washing machine: start > 10 W (with min hold), finish after stop delay\n- Dishwasher: start/finish via typical power phases + stop delay\n\nTip: A short minimum hold time prevents false starts caused by brief spikes.": "Session (Start/Stop): Du bekommst eine Meldung, wenn ein Vorgang startet und später wieder endet – meist erkennbar über Leistungsschwellen und eine Stop‑Verzögerung.\n\nBeispiele:\n- E‑Bike laden: Start ab 50 W, Ende < 15 W für 5 min\n- Waschmaschine: Start > 10 W (mit Mindestdauer), Ende nach Stop‑Delay\n- Spülmaschine: Start/Ende über typische Leistungsphasen + Stop‑Delay\n\nTipp: Mindesthaltezeit beim Start verhindert Fehlstarts durch kurze Peaks.",
	"Set how often an update must arrive at the latest.\nTip: Use a bit more buffer if devices sometimes send with delay.": "Stelle hier ein, wie oft spätestens ein Update kommen muss.\nTipp: Nimm lieber etwas mehr Puffer, wenn Geräte manchmal verzögert senden.",
	"Short description. If empty, msghub may use a default text later.": "Kurze Beschreibung. Wenn leer, nutzt msghub später einen Standardtext.",
	"Short title. If empty, msghub may use a default title later.": "Kurzer Titel. Wenn leer, nutzt msghub später einen Standardtitel.",
	"Stabilization": "Stabilisierung",
	"Start": "Start",
	"Start threshold": "Start-Schwelle",
	"Starts when power is above this threshold.": "Startet, wenn die Leistung über dieser Schwelle liegt.",
	"Stop / finished": "Stop / Fertig",
	"Stop threshold (W)": "Stop-Schwelle (W)",
	"Suppress repeated messages for this duration (0 = off).": "Unterdrückt wiederholte Meldungen für diese Zeit (0 = aus).",
	"Text": "Text",
	"Text (optional)": "Text (optional)",
	"The condition must hold for this duration before alerting (0 = immediate).": "Bedingung muss so lange gelten, bevor gemeldet wird (0 = sofort).",
	"The reaction must happen within this time.": "In dieser Zeit muss die Reaktion passieren.",
	"The session is considered finished only if power stays below the stop threshold for this duration.": "Session gilt erst als fertig, wenn die Leistung so lange unter der Stop‑Schwelle bleibt.",
	"This is the trigger source, e.g., a switch (valve, plug), a mode or a state.": "Das ist der Auslöser, z. B. ein Schalter (Ventil, Steckdose), ein Modus oder ein Zustand.",
	"This object is managed automatically": "Dieses Objekt wird automatisch überwacht",
	"This tab is only visible in expert mode.\nCurrently there are no inputs in this tab.": "Dieser Tab ist nur im Expert‑Mode sichtbar.\nAktuell gibt es in diesem Tab keine Eingaben.",
	"Threshold": "Schwellenwert",
	"Threshold: You get a message if a numeric value is too low/too high, leaves a defined range, or a boolean stays TRUE/FALSE for too long.\n\nExamples:\n- Battery < 10% → warning/error\n- Humidity < 35% for 30 min → notice (“Please ventilate”)\n- Window contact is open for 12 h (TRUE/FALSE depending on device) → warning\n\nTip: Hysteresis and minimum duration help to avoid flapping and short spikes.": "Schwellenwert: Du bekommst eine Meldung, wenn ein Zahlenwert zu klein/zu groß ist, einen Bereich verlässt oder ein Boolean zu lange TRUE/FALSE bleibt.\n\nBeispiele:\n- Batterie < 10 % → warning/error\n- Luftfeuchte < 35 % für 30 min → notice („Bitte lüften“)\n- Fensterkontakt ist 12 h offen (TRUE/FALSE, je nach Gerät) → warning\n\nTipp: Hysterese und Mindestdauer helfen gegen Flattern und kurze Ausreißer.",
	"Time window": "Zeitfenster",
	"Timestamp": "Zeitstempel",
	"Timing": "Zeiteinstellung",
	"Title (optional)": "Titel (optional)",
	"Trend / leak": "Trend / Leckage",
	"Trend direction": "Trend-Richtung",
	"Trend window": "Trend-Fenster",
	"Trigger": "Trigger",
	"Trigger condition": "Trigger-Bedingung",
	"Trigger is TRUE": "Trigger ist TRUE",
	"Trigger object (ID)": "Trigger-Objekt (ID)",
	"Unit": "Einheit",
	"Value becomes at least (>= threshold)": "Wert wird mindestens (>= Schwelle)",
	"Value becomes at most (<= threshold)": "Wert wird höchstens (<= Schwelle)",
	"Value changes (at least 1 update/change)": "Wert ändert sich (mind. 1 Update/Change)",
	"Value decreases by at least (delta)": "Wert fällt um mindestens (Delta)",
	"Value increases by at least (delta)": "Wert steigt um mindestens (Delta)",
	"Value type": "Werttyp",
	"What must happen?": "Was muss passieren?",
	"When back to normal: close the message automatically.\nIf disabled: the message stays and must be acknowledged manually.": "Wenn wieder alles normal ist: Meldung automatisch schließen.\nWenn deaktiviert: Meldung bleibt und muss manuell bestätigt werden.",
	"When back to normal: wait this long and then remove the message (0 = immediately).": "Wenn wieder normal: warte diese Zeit und entferne dann die Meldung (0 = sofort).",
	"When is the trigger considered active?": "Wann gilt der Trigger als aktiv?",
	"When power falls below this threshold, the finish check starts.": "Wenn die Leistung darunter fällt, beginnt die Fertig‑Prüfung.",
	"When should a message be created? For booleans you can choose “is true”/“is false”.": "Wann soll eine Meldung entstehen? Für Boolean kannst du „ist wahr“/„ist falsch“ wählen.",
	"Which pattern do you want to detect?": "Welches Muster willst du erkennen?",
	"Which timestamp should be checked?\n- ts: counts every update (even if the value stays the same)\n- lc: counts only actual value changes": "Welche Zeit soll geprüft werden?\n- ts: zählt jede Aktualisierung (auch wenn der Wert gleich bleibt)\n- lc: zählt nur echte Wertänderungen",
	"above (>)": "über (>)",
	"any": "egal",
	"automatic": "automatisch",
	"below (<)": "unter (<)",
	"e.g. No update for 12h – please check sensor.": "z.B. Seit 12h keine Aktualisierung – bitte Sensor prüfen.",
	"e.g. Process has started.": "z.B. Vorgang hat begonnen.",
	"e.g. Sensor offline: Basement temperature": "z.B. Sensor offline: Keller-Temperatur",
	"e.g. Washing machine started": "z.B. Waschmaschine gestartet",
	"equals (=)": "gleich (=)",
	"equals (=) …": "gleich (=) …",
	"error": "error",
	"falling": "fallend",
	"false (falsy)": "falsch (falsy)",
	"greater than (>)": "größer als (>)",
	"inside range (min..max)": "innerhalb Bereich (min..max)",
	"is false (FALSE)": "ist falsch (FALSE)",
	"is true (TRUE)": "ist wahr (TRUE)",
	"lastChange (lc) – value changes only (lc)": "lastChange (lc) – nur Wertänderungen (lc)",
	"lastUpdate (ts) – every update (ts)": "lastUpdate (ts) – jede Aktualisierung (ts)",
	"less than (<)": "kleiner als (<)",
	"msghub adapter settings": "Adaptereinstellungen für msghub",
	"none (disabled)": "keine (deaktiviert)",
	"not defined / none": "not defined / none",
	"not equals (≠)": "ungleich (≠)",
	"notice": "notice",
	"option1": "Option1",
	"option2": "Option2",
	"outside range (min..max)": "außerhalb Bereich (min..max)",
	"rising": "steigend",
	"status": "status",
	"task": "task",
	"true (truthy)": "wahr (truthy)",
	"warning": "warning"
}
